app/models/student_team.rb

SELECT  "student_teams".* FROM "student_teams" WHERE "student_teams"."student_id" = ? AND (end_date IS NULL) ORDER BY "student_teams"."id" ASC LIMIT ?  [["student_id", 1], ["LIMIT", 1]]
---
  def end_previous_team_assignment
    current_assignment = self.student.student_teams.current.first